espruino/Espruino/libs/banglejs/banglejs3_py32/src/main.c
/*
 * This file is part of Espruino, a JavaScript interpreter for Microcontrollers
 *
 * Copyright (C) 2026 Gordon Williams <gw@pur3.co.uk>
 *
 * This Source Code Form is subject to the terms of the Mozilla Public
 * License, v. 2.0. If a copy of the MPL was not distributed with this
 * file, You can obtain one at http://mozilla.org/MPL/2.0/.
 *
 * ----------------------------------------------------------------------------
 * LCD driver firmware for Bangle.js 3
 * ----------------------------------------------------------------------------
 */
#include "py32f07x_hal.h"
#include "main.h"
#include "swd.h"
#include "lcd.h"
#include "mini_rtt.h"

/* TODO:

Watchdog
Disable RTT (or make it switchable?)

*/

static void APP_SystemClockConfig(void);
static void APP_GPIO_Config(void);
static void APP_LCD_GPIO_Config(void);

// ----------------------------------------
EXTI_HandleTypeDef hexti_pa0;
EXTI_HandleTypeDef hexti_pa11;
EXTI_HandleTypeDef hexti_pa15;
ADC_HandleTypeDef hadc;
SPI_HandleTypeDef hspi1;
DMA_HandleTypeDef hdma_spi1_rx;
DMA_HandleTypeDef hdma_spi1_tx;
RTC_HandleTypeDef hrtc;
// ----------------------------------------

#define LCD_ROWS_BUFFERED 16
#define LCD_ROW_BYTES 180 // 240 * 6 bit (in bytes)
#define LCD_ROW_STRIDE LCD_ROW_BYTES // 240 * 6 bit (in bytes)
#define SPI_BUFFER_LEN (LCD_ROW_STRIDE*(LCD_ROWS_BUFFERED*2)) // enough for display - 2x sets of lines (with first byte as command byte)
uint8_t spiBuffer[SPI_BUFFER_LEN];
uint8_t spiWriteIdx; //< index we're currently writing to
volatile uint16_t spiBufferBytes[2]; // is first or second part of the SPI buffer ready?

PY32State state;

void APP_ErrorHandler(void)
{
  int flash=11;
  while (--flash) { // flash torch on app error
    HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_8);
    HAL_Delay(50);
  }
   while (1);
}

void Fatal_Error(const char *msg) {
  lcd_clear();
  lcd_print("LCD ERROR\r\n");
  lcd_println((char*)msg);
  APP_ErrorHandler();
}

uint32_t read_button_adc(void) {
  uint32_t raw_value = 0;
  // Start the ADC peripheral conversion
  HAL_ADC_Start(&hadc);
  // Poll until conversion completes (with a 10ms timeout window)
  if (HAL_ADC_PollForConversion(&hadc, 10) == HAL_OK) {
      // Fetch the converted 12-bit result from the data register
      raw_value = HAL_ADC_GetValue(&hadc);
  }
  // Stop conversion to save internal operational power
  HAL_ADC_Stop(&hadc);
  return raw_value;
}

static void D() { /*for (volatile int i=0;i<0;i++);*/ }
static void DX() { for (volatile int i=0;i<100;i++); }

/// Reset the buffer contents for next SPI transaction
void SPI1_Reset_Buffer(int p) {
  HAL_SPI_DMAStop(&hspi1); // ensure HAL_SPI_TransmitReceive_DMA can succeed
  spiBufferBytes[0] = 0;
  spiBufferBytes[1] = 0;
  spiWriteIdx = 0;
  uint8_t *buf = spiBuffer;
  buf[0] = state.buttonMask | (state.input<<4);
  buf[1] = state.output&255;
  buf[2] = state.output>>8;

  // Totally reset SPI peripheral to clear out unsent bytes
  uint32_t oldCR1 = SPI1->CR1;
  __HAL_RCC_SPI1_FORCE_RESET();
  __HAL_RCC_SPI1_RELEASE_RESET();
  SPI1->CR1 |= oldCR1;
  // Queue up new data
  HAL_StatusTypeDef err = HAL_SPI_TransmitReceive_DMA(&hspi1, spiBuffer, spiBuffer, SPI_BUFFER_LEN);
  if (err != HAL_OK) {
    rtt_printf("SPI_TR_DMA err %d\n", err);
    char buf[32] = "SPI DMA restart 0";
    buf[16] += p;
    Fatal_Error(buf);
  }
}

// Call if state.buttonPressed - this checks the ADC to figure out if a button has been pressed
void check_buttons() {
  static uint32_t lastVal = 0;
  static uint16_t valStable = 0;

  uint32_t val = read_button_adc();
  int diff = val-lastVal;
  if (diff<0) diff = -diff;
  lastVal = val;
  if (diff<10) {
    if(valStable<65535) valStable++;
  } else valStable=0;
  //rtt_printf("b%d %d %d\n",val, diff, valStable);
  if (valStable>200) { // wait until a stable reading
    int nearest = 0;
    if (val > 0x800) {
      state.buttonPressed = false;
      state.buttonLength = 0;
    } else { // search for nearest button state
      uint16_t buttonValues[16] = {
        0xFFFF,        0xC0,        0x196,        0x86,
        0x308,        0xA0,        0x11E,        0x76,
        0x55D,        0xB1,        0x154,        0x80,
        0x235,        0x95,        0xFA,        0x70 };
      int nearestDiff = 0xFFFF;
      for (int i=1;i<16;i++) {
        int diff = (val>buttonValues[i]) ? (val-buttonValues[i]) : (buttonValues[i]-val);
        if (diff<nearestDiff) {
          nearestDiff = diff;
          nearest = i;
        }
      }
    }
    if (state.buttonMask != nearest) { // button state changed - update IRQ flag
      state.buttonLength = 0;
      // FIXME: what about a button pressed so quick it changes before we can poll?
      rtt_printf("BTN %d\n",nearest);
      state.buttonMask = nearest;
      Set_State_Changed();
    } else {
      if (state.buttonLength < 65535)
        state.buttonLength++;
      // 4 button long-press reboot
      if (state.buttonLength==PY32_4BTN_REBOOT_DELAY && state.buttonMask==15) {
        rtt_printf("nRF reboot\n");
        nrf_reboot();
      }
    }
  }
}

void flip_from_spi() {
  int spiIdx = 0; // 0 or 1 for first/second half
  rtt_printf("y=%d\n", state.displayY);

  volatile uint32_t *GPIOA_ODR = &GPIOA->ODR;
  volatile uint32_t *GPIOA_BSRR = &GPIOA->BSRR;
  volatile uint32_t *GPIOA_BRR = &GPIOA->BRR;

  LCD_XRST(0);DX();DX();DX();DX();DX();
  LCD_XRST(1);D();
  LCD_VCK(0);DX();
  LCD_VST(1);DX();
  LCD_VCK(1);DX();
  LCD_VST(0);DX();
  LCD_VCK(0);DX();
  LCD_VCK(1);DX();

  // handle partial updates by skipping lines
  for (int y=0;y<state.displayY;y++) {
    // 2us delay - the timing of these is actually quite important as
    // too much delay means our buffer overruns before we get to transmit
    LCD_VCK(0);for (volatile int i=0;i<10;i++);
    LCD_VCK(1);for (volatile int i=0;i<10;i++);
  }

  while (true) { // each block is one half of the SPI buffer
    // wait until buffer is ready or time out
    int timeout = 500000;
    while (!spiBufferBytes[spiIdx]) {
      if (state.buttonPressed)
        check_buttons(); // check button state when waiting for SPI data
      if (--timeout <= 0) {
        rtt_printf("timeout\n");
        LCD_ENB(0); // flash LED to show we've had a timeout error
        SPI1_Reset_Buffer(2);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, 1);
        HAL_Delay(50);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, 0);
        Write_IRQ(state.irqAsserted); // re-enable IRQ if it should have been asserted
        return;
      }
    }
    // now start sending data
    uint8_t *buf = spiIdx ? &spiBuffer[SPI_BUFFER_LEN>>1] : spiBuffer;
    rtt_printf("->%d\n", spiIdx+1);
#define LCD_FAST 1
#define NO_REORDER __asm__ __volatile__("" ::: "memory")

    LCD_ENB(1);DX(); // start writing to the display now

    int bytesInBuf = spiBufferBytes[spiIdx];


