espruino/Espruino/libs/banglejs/banglejs3_py32/src/main.c
    for (;bytesInBuf>0;bytesInBuf-=LCD_ROW_STRIDE) {
      uint8_t *linePtr = buf; // 6bpp * 240px / 8bits (+1 command byte)
      buf += LCD_ROW_STRIDE;
      uint8_t *px;
      uint32_t ODR;
      /*
        We have to do a line of pixels MSB, then LSB
          R1R2G1G2B1B2
        But our pixels come in order:
          RlRhGlGhBlBhRlRhGlGhBlBh...

        So, we have to shuffle pixels around:

          RlRhGlGhBlBhRlRhGlGhBlBh...
        & 0 1 0 1 0 1 0 0 0 0 0 0
        & 0 0 0 0 0 0 0 1 0 1 0 1

        MSB: (C&42>>1) | ((c&2688)>>6)
        LSB: C&21 | ((c&1344)>>5)

        *but* this is for 12 bits = 2 pixels, which aligns badly. We could do 24 bits:

        MSB: (C&172074>>1) | ((c&11012736)>>6)
        LSB: C&86037 | ((c&5506368)>>5)

        LCD_FAST uses direct register writes to improve transit speed. When doing this, we
        run the risk of clocking too fast, so we spread out our byte reads for the next 4 bytes
        between each set (of clock/ODR/etc)
      */
      LCD_HST(1);D();
      LCD_HCK(1);D();
      LCD_HST(0);D();
      // MSB
      px = linePtr;
      ODR = *GPIOA_ODR & 0xFFFFFF80; // AND out colour + HCK, HCK=0
      uint32_t d; // input pixel data
#if LCD_FAST
      d = *(px++); // (fast only) Cortex M0+ doesn't do unaligned access
      d |= *(px++)<<8; // Cortex M0+ doesn't do unaligned access
      d |= *(px++)<<16; // Cortex M0+ doesn't do unaligned access
#endif
      for (int x=0;x<240;x+=4) {
        #if LCD_FAST // FAST
        uint32_t c = ((d&172074)>>1) | ((d&11012736)>>6);
        *GPIOA_ODR = ODR | (c&63); NO_REORDER; // LCD_COL(...)
        c>>=12;
        d = *(px++); // Cortex M0+ doesn't do unaligned access
        *GPIOA_BSRR = (1<<6); NO_REORDER; // LCD_HCK(1);
        d |= *(px++)<<8; // Cortex M0+ doesn't do unaligned access
        *GPIOA_ODR = ODR | (1<<6) | c; NO_REORDER; // LCD_COL(...)
        d |= *(px++)<<16; // Cortex M0+ doesn't do unaligned access
        *GPIOA_BRR = (1<<6); NO_REORDER; // LCD_HCK(0);
        #else // SLOW
        uint32_t c = *(px++); // Cortex M0+ doesn't do unaligned access
        c |= *(px++)<<8; // Cortex M0+ doesn't do unaligned access
        c |= *(px++)<<16;
        c = ((c&172074)>>1) | ((c&11012736)>>6);
        LCD_COL(c); // already ANDs by 63
        LCD_HCK(1);
        LCD_COL(c>>12);
        LCD_HCK(0);
        #endif
      }
      D();
      LCD_VCK(0);D();
      LCD_HST(1);D();
      LCD_HCK(1);D();
      LCD_HST(0);D();
      // LSB
      px = linePtr;
      ODR = *GPIOA_ODR & 0xFFFFFF80; // AND out colour + HCK, HCK=0
#if LCD_FAST
      d = *(px++); // (fast only) Cortex M0+ doesn't do unaligned access
      d |= *(px++)<<8; // Cortex M0+ doesn't do unaligned access
      d |= *(px++)<<16; // Cortex M0+ doesn't do unaligned access
#endif
      for (int x=0;x<240;x+=4) {
        #if LCD_FAST // FAST
        uint32_t c = (d&86037) | ((d&5506368)>>5);
        *GPIOA_ODR = ODR | (c&63); NO_REORDER; // LCD_COL(...)
        c>>=12;
        d = *(px++); // Cortex M0+ doesn't do unaligned access
        *GPIOA_BSRR = (1<<6); NO_REORDER; // LCD_HCK(1);
        d |= *(px++)<<8; // Cortex M0+ doesn't do unaligned access
        *GPIOA_ODR = ODR | (1<<6) | c; NO_REORDER; // LCD_COL(...)
        d |= *(px++)<<16; // Cortex M0+ doesn't do unaligned access
        *GPIOA_BRR = (1<<6); NO_REORDER; // LCD_HCK(0);
        #else // SLOW
        uint32_t c = *(px++); // Cortex M0+ doesn't do unaligned access
        c |= *(px++)<<8; // Cortex M0+ doesn't do unaligned access
        c |= *(px++)<<16;
        c = (c&86037) | ((c&5506368)>>5);
        LCD_COL(c); // already ANDs by 63
        LCD_HCK(1);
        LCD_COL(c>>12);
        LCD_HCK(0);
        #endif
      }
      D();
      LCD_VCK(1);D();
    }
    // we've finished this block... wait until next block has finished writing
    spiBufferBytes[spiIdx] = 0;
    spiIdx = spiIdx^1;
    // no data ready and SPI finished -> exit
    if (!spiBufferBytes[spiIdx] && !state.spiInProgress) {
      rtt_printf("End %d %d\n", spiBufferBytes[spiIdx], state.spiInProgress);
      LCD_ENB(0); // cancelled - exit.
      SPI1_Reset_Buffer(10);
      Write_IRQ(state.irqAsserted); // re-enable IRQ if it should have been asserted
      return;
    }
  }
}

void Write_IRQ(bool asserted) {
  if (!state.displayInProgress)
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, !asserted);
  state.irqAsserted = asserted;
}

void BTN_Callback() {
  state.buttonPressed = true;
}

void Update_Outputs() {
  PY32OutputState o = state.output;
  /*lcd_print("O ");
  lcd_print_hex(o);
  lcd_println("");*/
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, (o&PY32_OUT_LCD_BL)?1:0);
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, (o&PY32_OUT_TORCH_ON)?1:0);
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, 1/*(o&PY32_OUT_AUX_SWAP)?1:0*/);
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_9, (o&PY32_OUT_AUX_POWER)?0:1); // inverted. PY32_OUT_AUX_POWER set will enable the output
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_13, (o&PY32_OUT_RGB_ON)?1:0);
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_14, (o&PY32_OUT_SPEAKER_ON)?1:0);
  HAL_GPIO_WritePin(GPIOF, GPIO_PIN_6, (o&PY32_OUT_VIBRATE_ON)?1:0);
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_15, (o&PY32_OUT_CHARGE_EN)?1:0);
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_12, (o&PY32_OUT_WIFI_ON)?1:0);
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_15, (o&PY32_OUT_WIFI_BOOTLOADER)?1:0);
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_10, (o&PY32_OUT_TOUCH_RST)?1:0);
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_14, (o&PY32_OUT_HRM_AUX)?1:0);
}

void nrf_reboot() {
  // set up nRST pin
  GPIO_InitTypeDef  GPIO_InitStruct;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Pin = GPIO_PIN_12; // MOTO PWM
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
  // toggle nrst
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12, 0);
  HAL_Delay(10);
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12, 1);
}

/// Called when an SPI transaction has completed (or the buffer is full!)
void SPI1_HandlePacket(int bytes_received) {
  uint8_t *buf = spiBuffer;
  uint8_t cmd = buf[0];
  switch (cmd) {
    case PY32_CMD_NONE:
      Write_IRQ(false); // assume status is read
      break;
    case PY32_CMD_SET_OUTPUT:
      Write_IRQ(false); // assume status is read
      state.output = buf[1] | (buf[2]<<8);
      Update_Outputs();
      break;
    case PY32_CMD_DISPLAY:
      bool irqWasAsserted = state.irqAsserted;
      Write_IRQ(false); // if we're busy with the LCD, don't assert the IRQ line
      state.irqAsserted |= irqWasAsserted;
      state.displayInProgress = true;
      state.displayY = buf[1];
      break;
  }
}

