espruino/Espruino/libs/banglejs/banglejs3_py32/src/main.c
/// SPI NSS state has changed
void SPI1_NSS_Callback() {
  bool nss_pin_state = HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_15) == GPIO_PIN_SET;
  if (nss_pin_state) { // idle - so transaction is complete
    /* If we've sent exactly half an SPI buffer then HAL_SPI_TxRx*CpltCallback has
    already been called at this point. However we could use bytes_received to allow
    us to cope with what happens when only part of a buffer has been sent to allow
    us to do smaller updates. */
    state.spiInProgress = false;
    bool wasDisplayUpdate = state.displayInProgress;
    state.displayInProgress = false;
    //__HAL_DMA_GET_COUNTER(hspi1.hdmarx);//
    uint32_t bytes_left = hspi1.hdmarx->Instance->CNDTR;
    uint32_t bytes_received = SPI_BUFFER_LEN - bytes_left;
    if (spiWriteIdx) // second half of buffer
      bytes_received -= SPI_BUFFER_LEN>>1;
    // FIXME: use bytes_received to handle partial updates being sent to display
    rtt_printf("NSS %d %d\n", bytes_received, spiBuffer[0]);
    spiBufferBytes[spiWriteIdx] = bytes_received;
    // restart SPI transaction for next packet
    if (!wasDisplayUpdate) { // we can't restart if we're currently writing to the screen!
      SPI1_HandlePacket(bytes_received);
      SPI1_Reset_Buffer(4);
      state.input &= ~PY32_IN_TOUCH_IRQ; // so we definitely sent touch IRQ state - clear the flag
    }
    //rtt_printf("-\n");
    SET_BIT(SPI1->CR1, SPI_CR1_SSI); // disable SPI
  } else { // transaction start
    CLEAR_BIT(SPI1->CR1, SPI_CR1_SSI); // enable SPI
    state.spiInProgress = true;
    //rtt_printf("SS\n");
  }
}

// Called when the DMA finishes transferring the FIRST half of the buffer (index 0 to BUFFER_SIZE/2 - 1)
void HAL_SPI_TxRxHalfCpltCallback(SPI_HandleTypeDef *hspi) {
  // Safe to read/write the FIRST half of tx_buffer and rx_buffer
  // Process rx_buffer[0] through rx_buffer[(BUFFER_SIZE/2) - 1]
  if (hspi->Instance == SPI1) {
    if (!state.displayInProgress) // if we're displaying, main loop should handle this when spiWriteSecondHalf changed
      SPI1_HandlePacket(sizeof(spiBuffer[0]));
    spiBufferBytes[0] = SPI_BUFFER_LEN>>1; // first half is ready
    spiWriteIdx = 1;
  }
}

// Called when the DMA finishes transferring the SECOND half of the buffer (index BUFFER_SIZE/2 to BUFFER_SIZE - 1)
void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi) {
  // Safe to read/write the SECOND half of tx_buffer and rx_buffer
  // Process rx_buffer[BUFFER_SIZE/2] through rx_buffer[BUFFER_SIZE - 1]
  if (hspi->Instance == SPI1) {
    spiBufferBytes[1] = SPI_BUFFER_LEN>>1; // second half is ready now
    spiWriteIdx = 0;
  }
}

void Set_State_Changed() {
  if (!state.spiInProgress) {
    SPI1_Reset_Buffer(5);
  }
  // FIXME: What if we're currently busy? How do we flag a new state change?
  Write_IRQ(true);
}

// Called when touchscreen state changes
void Touch_IRQ_Callback() {
  if (!state.initialised) return;
  bool irq_state = HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_11) != GPIO_PIN_SET; // inverted
  if (irq_state) {
    // touch pin is pulsed, so we don't care about current state
    state.input |= PY32_IN_TOUCH_IRQ;
    rtt_printf("T+\n");
    Set_State_Changed();
  }
  // FIXME: update input state
}


void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi) {
  rtt_printf("SPI ERR %d\n", hspi->ErrorCode);
  lcd_print_hex(hspi->ErrorCode);
  lcd_println(" SPI ERR");
  if (hspi->ErrorCode & HAL_SPI_ERROR_OVR) {
    __HAL_SPI_CLEAR_OVRFLAG(hspi);
    hspi->ErrorCode = HAL_SPI_ERROR_NONE;
    hspi->State     = HAL_SPI_STATE_READY;
    // re-enable
    SPI1_Reset_Buffer(6);
  }
  hspi->ErrorCode = 0;
}

void HAL_SPI_AbortCpltCallback(SPI_HandleTypeDef *hspi)
{
  lcd_println("SPI ABORT");
}

int main(void) {
  rtt_printf("LCD "LCD_VERSION"\n");
  HAL_Init();
  /* LCD GPIO Config */
  APP_LCD_GPIO_Config();
  lcd_init();
  lcd_println("LCD "LCD_VERSION"\r\n");

  state.initialised = false;
  state.output = PY32_OUT_DEFAULTS;

  /* System Clock Configuration */
  APP_SystemClockConfig();


  /* GPIO Initialization */
  APP_GPIO_Config();
  HAL_Delay(10);

  //swdInit();
  //swdReset();
  //swdKill();
  // or use PA12 NRF54 NRST for reset?

  lcd_println("BANGLE.JS 3 BOOTING...");

  // FIXME - look out for SPI commands coming in. If no command,
  // enter recovery mode using SWD commands.

  state.initialised = true;


  while (1) {
    //HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_8);
    if (state.buttonPressed) {
      check_buttons();
    }
    if (state.displayInProgress) {
      flip_from_spi();
    } else if (!state.spiInProgress && !state.buttonPressed && !state.irqAsserted) {
      // don't suspend if IRQ is asserted since we'll be woken up very soon anyway
      HAL_SuspendTick();
      HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_SLEEPENTRY_WFI); // actually sleep
      HAL_ResumeTick();
    }
  }
}

static void APP_LCD_GPIO_Config(void) {
  GPIO_InitTypeDef  GPIO_InitStruct;
  // enable clocks
  __HAL_RCC_GPIOA_CLK_ENABLE();

  // LCD IOs
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Pin = GPIO_PIN_0| // LCD R1
                        GPIO_PIN_1| // LCD R2
                        GPIO_PIN_2| // LCD G1
                        GPIO_PIN_3| // LCD G2
                        GPIO_PIN_4| // LCD B1
                        GPIO_PIN_5| // LCD B2
                        GPIO_PIN_6| // LCD HCLK
                        GPIO_PIN_7| // LCD VCLK
                        GPIO_PIN_8| // LCD HST
                        GPIO_PIN_9| // LCD VST
                        GPIO_PIN_10| // LCD ENB
                        GPIO_PIN_11; // LCD XRST
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
}

static void APP_GPIO_Config(void) {
  GPIO_InitTypeDef  GPIO_InitStruct;
  EXTI_ConfigTypeDef EXTI_ConfigStruct;

  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_SYSCFG_CLK_ENABLE();
  __HAL_RCC_ADC_CLK_ENABLE();
  __HAL_RCC_DMA_CLK_ENABLE();
  __HAL_RCC_SPI1_CLK_ENABLE();
  __HAL_RCC_PWR_CLK_ENABLE();

  // Enable Write Access to Backup/RTC Domain */
  HAL_PWR_EnableBkUpAccess();
  __HAL_RCC_RTCAPB_CLK_ENABLE();
  __HAL_RCC_RTC_ENABLE();

  // Setup IOs
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Pin = GPIO_PIN_6; // MOTO PWM
  HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);
  //GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP; // FIXME
  GPIO_InitStruct.Pin = GPIO_PIN_5; // LCD FRP
  HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);

  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Pin = GPIO_PIN_2|  // AUX IOSwap (0=SWD, 1=GPIO)
                        GPIO_PIN_6|  // LCD Backlight
                        GPIO_PIN_8| // torch
                        GPIO_PIN_9| // aux power
                        GPIO_PIN_10| // touch RST
                        GPIO_PIN_12| // wifi en
                        GPIO_PIN_13| // RGB en
                        GPIO_PIN_14| // speaker en
                        GPIO_PIN_15; // wifi boot mode
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_10, 0); // reset touchscreen
  HAL_Delay(1);
  Update_Outputs(); // set all to default (including touchscreen reset off)
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

