espruino/Espruino/libs/banglejs/banglejs3_py32/src/main.c
  /*lcd_print("BDCR ");lcd_print_hex(RCC->BDCR);
  lcd_print("\r\nCSR ");lcd_print_hex(RCC->CSR);
  lcd_print("\r\nCRL ");lcd_print_hex(RTC->CRL);
  lcd_print("\r\nPRLL ");lcd_print_hex(RTC->PRLL);
  lcd_print("\r\nPRLH ");lcd_print_hex(RTC->PRLH);
  lcd_print("\r\nCR1 ");lcd_print_hex(PWR->CR1);
  lcd_print("\r\nCR2 ");lcd_print_hex(PWR->CR2);
  lcd_print("\r\n");*/

  // Enable FRP square wave
  hrtc.Instance = RTC;
  hrtc.Init.AsynchPrediv   = RTC_AUTO_1_SECOND;   // Default prediv values for 32.768kHz LSE/LSI
  // AsynchPrediv doesn't seem to have an effect on RTC_OUT
  // RTC_OUTPUTSOURCE_CALIBCLOCK outputs 512hz square wave
  // RTC_OUTPUTSOURCE_SECOND outpus 1 second pulse (not square wave)
  hrtc.Init.OutPut         = RTC_OUTPUTSOURCE_CALIBCLOCK;          // Clear default alarm/tamper output routing
  int e;

  if ((e=HAL_RTC_Init(&hrtc)) != HAL_OK)
    Fatal_Error("RTC");


  // Touch IRQ line
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Pin = GPIO_PIN_11;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
  EXTI_ConfigStruct.Line = EXTI_LINE_11;
  EXTI_ConfigStruct.Mode = EXTI_MODE_INTERRUPT;
  EXTI_ConfigStruct.Trigger = EXTI_TRIGGER_RISING_FALLING;
  EXTI_ConfigStruct.GPIOSel = EXTI_GPIOB;
  HAL_EXTI_SetConfigLine(&hexti_pa11, &EXTI_ConfigStruct);
  HAL_EXTI_RegisterCallback(&hexti_pa11, HAL_EXTI_COMMON_CB_ID, Touch_IRQ_Callback);
  Touch_IRQ_Callback(); // force input state update
  // HAL_NVIC* below for SPI NSS

  // SPI IRQ line (default not asserted)
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Pin = GPIO_PIN_13;
  Write_IRQ(false);
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  // NRF SWD open circuit by default
  GPIO_InitStruct.Mode      = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull      = GPIO_NOPULL;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Pin = GPIO_PIN_0 | // NRF SWDIO
                        GPIO_PIN_1;  // NRF SWCLK
  HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);

  // SPI
  // Configure SPI1 Pins on Port B (PB3=SCK, PB4=MISO, PB5=MOSI)
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull      = GPIO_NOPULL;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF0_SPI1;
  GPIO_InitStruct.Pin       = GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
  // Configure Hardware Chip Select Pin on PA15 (NSS)
  GPIO_InitStruct.Pin       = GPIO_PIN_15;
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;// FIXME GPIO_MODE_INPUT?
  GPIO_InitStruct.Pull      = GPIO_PULLUP;
  GPIO_InitStruct.Alternate = GPIO_AF0_SPI1;  // Maps PA15 as Hardware SPI1_NSS
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  // Configure DMA Channel 1 for SPI1_RX
  hdma_spi1_rx.Instance                  = DMA1_Channel1; // Check your PY32 reference manual for specific channel mapping
  hdma_spi1_rx.Init.Direction            = DMA_PERIPH_TO_MEMORY;
  hdma_spi1_rx.Init.PeriphInc            = DMA_PINC_DISABLE;
  hdma_spi1_rx.Init.MemInc               = DMA_MINC_ENABLE;
  hdma_spi1_rx.Init.PeriphDataAlignment  = DMA_PDATAALIGN_BYTE;
  hdma_spi1_rx.Init.MemDataAlignment     = DMA_MDATAALIGN_BYTE;
  hdma_spi1_rx.Init.Mode                 = DMA_CIRCULAR;
  hdma_spi1_rx.Init.Priority             = DMA_PRIORITY_VERY_HIGH; // Prioritize receiving to avoid overruns
  if (HAL_DMA_Init(&hdma_spi1_rx) != HAL_OK)
    Fatal_Error("DMA RX init");
  HAL_DMA_ChannelMap(&hdma_spi1_rx, DMA_CHANNEL_MAP_SPI1_RD);
  __HAL_LINKDMA(&hspi1, hdmarx, hdma_spi1_rx);

  // Configure DMA Channel 2 for SPI1_TX
  hdma_spi1_tx.Instance                  = DMA1_Channel2;
  hdma_spi1_tx.Init.Direction            = DMA_MEMORY_TO_PERIPH;
  hdma_spi1_tx.Init.PeriphInc            = DMA_PINC_DISABLE;
  hdma_spi1_tx.Init.MemInc               = DMA_MINC_ENABLE;
  hdma_spi1_tx.Init.PeriphDataAlignment  = DMA_PDATAALIGN_BYTE;
  hdma_spi1_tx.Init.MemDataAlignment     = DMA_MDATAALIGN_BYTE;
  hdma_spi1_tx.Init.Mode                 = DMA_CIRCULAR;
  hdma_spi1_tx.Init.Priority             = DMA_PRIORITY_LOW;
  if (HAL_DMA_Init(&hdma_spi1_tx) != HAL_OK)
    Fatal_Error("DMA TX init");
  HAL_DMA_ChannelMap(&hdma_spi1_tx, DMA_CHANNEL_MAP_SPI1_WR);
  __HAL_LINKDMA(&hspi1, hdmatx, hdma_spi1_tx);


  HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, 1, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);
  HAL_NVIC_SetPriority(DMA1_Channel2_3_IRQn, 1, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel2_3_IRQn);

  // Configure SPI Slave Parameters
  hspi1.Instance               = SPI1;
  hspi1.Init.Mode              = SPI_MODE_SLAVE;
  hspi1.Init.Direction         = SPI_DIRECTION_2LINES;
  hspi1.Init.DataSize          = SPI_DATASIZE_8BIT;
  hspi1.Init.CLKPolarity       = SPI_POLARITY_LOW;
  hspi1.Init.CLKPhase          = SPI_PHASE_1EDGE;
  hspi1.Init.NSS               = SPI_NSS_SOFT;    // Hardware tracked frame line
  hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2; // Not used in slave mode
  hspi1.Init.FirstBit          = SPI_FIRSTBIT_MSB;
  hspi1.Init.CRCCalculation    = SPI_CRCCALCULATION_DISABLE;
  hspi1.Init.CRCPolynomial     = 1; // unused

  if (HAL_SPI_Init(&hspi1) != HAL_OK)
    Fatal_Error("SPI Init");

  CLEAR_BIT(SPI1->CR1, SPI_CR1_SSI); // activate SPI

   // Force the internal SSI bit HIGH initially so the slave is deselected
   //SET_BIT(SPI1->CR1, SPI_CR1_SSI);

  // No need to enable Slave Fast Speed Mode (SPI_CR2_SLVFM) if Master SCK >= PCLK/4 on PY32F040

  // Enable Core Interrupts
  HAL_NVIC_SetPriority(SPI1_IRQn, 2, 0);
  HAL_NVIC_EnableIRQ(SPI1_IRQn);

  // SPI NSS interrupt for slave frame detection
  EXTI_ConfigStruct.Line = EXTI_LINE_15;
  EXTI_ConfigStruct.Mode = EXTI_MODE_INTERRUPT;
  EXTI_ConfigStruct.Trigger = EXTI_TRIGGER_RISING_FALLING;
  EXTI_ConfigStruct.GPIOSel = EXTI_GPIOA;
  HAL_EXTI_SetConfigLine(&hexti_pa15, &EXTI_ConfigStruct);
  HAL_EXTI_RegisterCallback(&hexti_pa15, HAL_EXTI_COMMON_CB_ID, SPI1_NSS_Callback);
  HAL_NVIC_SetPriority(EXTI4_15_IRQn, 1, 0);
  HAL_NVIC_EnableIRQ(EXTI4_15_IRQn);

