espruino/Espruino/libs/banglejs/banglejs3_py32/src/main.c
  // Queue up the data response buffer
  SPI1_Reset_Buffer(7);

  if (hspi1.State == HAL_ERROR) {
    Fatal_Error("SPI State Error");
  }

  /* BUTTONS - PB0 as input */
  GPIO_InitStruct.Pin = GPIO_PIN_0;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL; // externally pulled up
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /* Triggered by falling edge of button */
  EXTI_ConfigStruct.Line = EXTI_LINE_0;
  EXTI_ConfigStruct.Mode = EXTI_MODE_INTERRUPT;
  EXTI_ConfigStruct.Trigger = EXTI_TRIGGER_FALLING;
  EXTI_ConfigStruct.GPIOSel = EXTI_GPIOB;
  HAL_EXTI_SetConfigLine(&hexti_pa0, &EXTI_ConfigStruct);
  HAL_EXTI_RegisterCallback(&hexti_pa0, HAL_EXTI_COMMON_CB_ID, BTN_Callback);
  HAL_NVIC_SetPriority(EXTI0_1_IRQn, 1, 0);
  HAL_NVIC_EnableIRQ(EXTI0_1_IRQn);


  // Configure ADC
  hadc.Instance = ADC1;
  hadc.Init.Resolution            = ADC_RESOLUTION_12B;       // 12-bit resolution (0-4095)
  hadc.Init.DataAlign             = ADC_DATAALIGN_RIGHT;
  hadc.Init.ScanConvMode          = ADC_SCAN_DISABLE;         // Reading a single channel
  hadc.Init.ContinuousConvMode    = DISABLE;                  // Software-triggered single read
  hadc.Init.NbrOfConversion       = 1;                        // Only one channel to read
  hadc.Init.DiscontinuousConvMode = DISABLE;
  hadc.Init.NbrOfDiscConversion   = 1;
  hadc.Init.ExternalTrigConv      = ADC_SOFTWARE_START;       // Manually trigger via code

  if (HAL_ADC_Init(&hadc) != HAL_OK)
    Fatal_Error("ADC Init");

  // Map PB0 (Channel 8) to the Conversion Sequence
  ADC_ChannelConfTypeDef sConfig = {0};
  sConfig.Channel      = ADC_CHANNEL_8;                       // Channel 8 = PB0
  sConfig.Rank         = ADC_REGULAR_RANK_1;             // Basic rank tracking for PY32
  sConfig.SamplingTime = ADC_SAMPLETIME_3CYCLES_5;           // Gives the sample cap time to charge
  if (HAL_ADC_ConfigChannel(&hadc, &sConfig) != HAL_OK)
    Fatal_Error("ADC Ch Init");

  // 5. Run Factory Calibration (Crucial step for PY32 accuracy)
  HAL_ADCEx_Calibration_Start(&hadc);
}





static void APP_SystemClockConfig(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE | RCC_OSCILLATORTYPE_HSI | RCC_OSCILLATORTYPE_LSI | RCC_OSCILLATORTYPE_LSE;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_16MHz; // fixme
  RCC_OscInitStruct.HSIDiv = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSEState = RCC_HSE_OFF;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.LSEState = RCC_LSE_OFF;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_OFF;
  /*RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_NONE;*/
  /*RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL2;*/
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    Fatal_Error("RCC Osc Conf");

  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSISYS;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK) // 0ws for <24MHz
    Fatal_Error("RCC Clk Conf");

  //HAL_RCC_MCOConfig(RCC_MCO4, RCC_MCO1SOURCE_LSI, RCC_MCODIV_128); // FIXME is MCODIV_128 correct?

  /* Connect LSI to the RTC Peripheral */
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_RTC;
  PeriphClkInit.RTCClockSelection    = RCC_RTCCLKSOURCE_LSI;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
    Fatal_Error("RCC Periph Clk");
}



#ifdef  USE_FULL_ASSERT
/**
  * @brief  Export assert error source and line number
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  while (1);
}
#endif /* USE_FULL_ASSERT */
